/*Напишите программу которая определяет какое из чисел больше*/
public class Home1Task7 {
    public static void main(String args[]) {
           int x = 7;
           int y = 9;
            if (x > y) {
                System.out.println("Число x больше числа y");
            }
            else {
                System.out.println("Число y больше числа x");
            }



    }
}
