/* Напишите программу которая определяет число четное или не четное */
public class Home1Task8 {
  public static void main(String args[]) {
         int x = 5;
          if (x%2 ==0) {
                System.out.println("Число x - четное");
            }
            else {
                System.out.println("Число x - не четное");
            }

        }

}

